In [1]:
import numpy as np       ### importing numpy and pandas
import pandas as pd

In [2]:
dataset = pd.read_csv("E:\MAYUKH\\naive bayes\\titanic\\titanic.csv")  ### import the csv dataset
dataset.head()          ### looking at the head of the csv dataset...

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
dataset.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True) ###Dropping the unwanted columns...
dataset.head()  ### After dropping the unwanted columns...

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
target=dataset.Survived                 ### Fixing Survived columns as target to predict the survivals...
inputs=dataset.drop('Survived',axis='columns') ### Columns other than "Survived" are taken as input...

In [5]:
dummies=pd.get_dummies(inputs.Sex) ### Converting the Sex column to integer type from text...
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
inputs = pd.concat([inputs,dummies],axis='columns') ### Appending the dummy columns replacing Sex columns in inputs...
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
inputs.drop('Sex',axis='columns',inplace=True) ### Dropping the Sex column...
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [8]:
inputs.columns[inputs.isna().any()] ### Searching for any NaN value in any column...found in Age column...

Index(['Age'], dtype='object')

In [9]:
inputs.Age[:10] ###Looking for the NaN values in Age column...

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean()) ### Filling the NaN values with the mean of the Age column...  
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [11]:
from sklearn.model_selection import train_test_split  ### importing the required split method from sklearn.model_selection package...
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2) ### Splitting the dataset in 80-20 ratio...

In [12]:
len(X_train) ### Checking the length of the X_component of training dataset...

712

In [13]:
len(X_test) ### Checking the length of the X_component of the testing dataset...

179

In [14]:
len(inputs) ### Length of the total dataset...

891

In [15]:
from sklearn.naive_bayes import GaussianNB ### importing the GaussianNB method from sklearn.naive_bayes package...
model = GaussianNB()  ### Creating a naive_bayes model...

In [16]:
model.fit(X_train,y_train) ### Running the model on training dataset...

GaussianNB()

In [17]:
model.score(X_test,y_test)  ### Accuracy of the model on the testing dataset...

0.7877094972067039

In [18]:
X_test[:10]  ### First 10 tuples of X_component of testing dataset...

     Pclass   Age     Fare  female  male
73        3  26.0  14.4542       0     1
624       3  21.0  16.1000       0     1
80        3  22.0   9.0000       0     1
520       1  30.0  93.5000       1     0
635       2  28.0  13.0000       1     0
252       1  62.0  26.5500       0     1
632       1  32.0  30.5000       0     1
890       3  32.0   7.7500       0     1
217       2  42.0  27.0000       0     1
744       3  31.0   7.9250       0     1

In [19]:
y_test[:10]  ### First 10 tuples of the y_component of the testing dataset...the target dataset...

73     0
624    0
80     0
520    1
635    1
252    0
632    1
890    0
217    0
744    1
Name: Survived, dtype: int64

In [20]:
model.predict(X_test[:10])  ### Predicting the first 10 tuples...

array([0, 0, 0, 1, 1, 0, 0, 0, 0, 0], dtype=int64)

In [21]:
model.predict_proba(X_test[:10]) ### Predicting the class probabilities for first 10 tuples...

array([[9.89072891e-01, 1.09271086e-02],
       [9.88295686e-01, 1.17043139e-02],
       [9.88350452e-01, 1.16495484e-02],
       [8.66667323e-04, 9.99133333e-01],
       [2.96605891e-02, 9.70339411e-01],
       [9.17730305e-01, 8.22696952e-02],
       [9.07417008e-01, 9.25829924e-02],
       [9.89612226e-01, 1.03877742e-02],
       [9.77848958e-01, 2.21510417e-02],
       [9.89516619e-01, 1.04833814e-02]])